TOKEN = ''  # telegram bot token
SPAM_RESTRICTION = 2  # seconds

GOOGLETABLE_ID = '1tGbeevMu_7_n_pKDFjH3cNFNigClVW3v'
GOOGLETABLE_URL = f'https://docs.google.com/spreadsheets/d/{GOOGLETABLE_ID}/export?exportFormat=xlsx'

classes_10 = (
    '10био', '10геохим', '10исс1', '10исс2', '10линг1', '10линг2', '10мат', '10матэк', '10мед', '10фил', '10фм', '10эк')
classes_11 = (
'11био', '11бх', '11гео', '11исс', '11линг1', '11линг2', '11мат1', '11мат2', '11мед', '11фил', '11фм', '11эк')
table_indexes = {'10б': 'B2', '10геохим': 'E2', '10исс1': 'H2', '10исс2': 'K2', '10линг1': 'N2', '10линг2': 'B8',
                 '10мат': 'E8', '10матэк': 'H8', '10мед': 'K8', '10фил': 'N8', '10фм': 'B14', '10эк': 'E14',
                 '11б': 'H14', '11бх': 'K14', '11гео': 'N14', '11исс': 'B20', '11линг1': 'E20', '11линг2': 'H20',
                 '11м1': 'K20', '11м2': 'N20', '11мед': 'B26', '11фил': 'E26', '11фм': 'H26', '11эк': 'K26'}

new_table = ['10б', '10геохим', '10исс1', '10иис2', '10линг1', '10линг2', '10мат', '10матэк', '10мед', '10фил', '10фм',
             '10эк', '11б', '11биохим', '11гео', '11ис', '11линг1', '11линг2', '11мат1', '11мат2', '11мед', '11фил', '11фм', '11эк']
alt_classes = {'10био': '10б', '10гх': '10геохим', '11исс-1': '11исс1', '11исс-2': '11исс2',
               '10линг-1': '10линг1', '10линг-2': '10линг2', '10м': '10мат', '10мэ': '10матэк', '10ф': '10фил',
               '10физмат': '10фм', '11био': '11б', '11биохим': '11бх', '11г': '11гео', '11и': '11ис', '11исс': '11ис',
               '11линг-1': '11линг1', '11линг-2': '11линг2', '11м1': '11мат1', '11мат-1': '11мат1',
               '11м2': '11мат2', '11мат-2': '11мат2', '11ф': '11фил', '11физмат': '11фм'}
