TOKEN = ''  # telegram bot token
SPAM_RESTRICTION = 2  # seconds

GOOGLETABLE_ID = '1tGbeevMu_7_n_pKDFjH3cNFNigClVW3v'
GOOGLETABLE_URL = f'https://docs.google.com/spreadsheets/d/{GOOGLETABLE_ID}/export?exportFormat=xlsx'

# ----------------------------------------------------------------------------------------------------------------------

available_days = ['23.01', '24.01', '25.01', '26.01', '27.01']

weektable_classes = ['10Б', '10геохим', '10исс1', '10иис2', '10линг1', '10линг2', '10мат', '10матэк', '10мед', '10фил',
                     '10фм', '10эк', '11Б', '11биохим', '11гео', '11ис', '11линг1', '11линг2', '11мат1', '11мат2',
                     '11мед', '11фил', '11фм', '11эк']

db_classes = ['био', 'геохим', 'исс1', 'исс2', 'линг1', 'линг2', 'мат', 'матэк', 'мед', 'фил',
              'фм', 'эк', 'био', 'биохим', 'гео', 'исс', 'линг1', 'линг2', 'мат1', 'мат2', 'мед',
              'фил', 'фм', 'эк']

db_classes_old = ['10био', '10геохим', '10исс1', '10исс2', '10линг1', '10линг2', '10мат', '10матэк', '10мед', '10фил',
              '10фм', '10эк', '11био', '11биохим', '11гео', '11исс', '11линг1', '11линг2', '11мат1', '11мат2', '11мед',
              '11фил', '11фм', '11эк']

alt_profiles = {
    'б': 'био',
    'гх': 'геохим',
    'исс-1': 'исс1', 'ис1': 'исс1', 'ис-1': 'исс1',
    'исс-2': 'исс2', 'ис2': 'исс2', 'ис-2': 'исс2', 'иис2': 'исс2',
    'линг-1': 'линг1',
    'линг-2': 'линг2',
    'м': 'мат',
    'мэ': 'матэк',
    # мед
    'ф': 'фил',
    'физмат': 'фм',
    'э': 'эк',

    'бх': 'биохим',
    'г': 'гео',
    'ис': 'исс',
    'мат-1': 'мат1', 'м1': 'мат1',
    'мат-2': 'мат2', 'м2': 'мат2',
}
